Catalogs/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПоПроизводственномуКалендарю</Name>
					<Comment>Признак "типового" графика работы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейРаботы</Name>
					<Comment>Количество дней работы для "нетиповых" графиков</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейОтдыха</Name>
					<Comment>Количество дней отдыха для "нетиповых" графиков</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГрафикиРаботы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// ++ SMPlekhanov@1bit.com 23.03.2024 [Самообучение]
// Обрабатывает изменение флажка "По производственному календарю".
// Делает поля "Дней работы" и "Дней отдыха" доступными или недоступными в зависимости от его значения.
&НаКлиенте
Процедура ПоПроизводственномуКалендарюПриИзменении(Элемент)
	Элементы.ДнейРаботы.Доступность = Не Объект.ПоПроизводственномуКалендарю;
	Элементы.ДнейОтдыха.Доступность = Не Объект.ПоПроизводственномуКалендарю;
КонецПроцедуры

// Выполняет проверку заполненности полей "Дней работы" и "Дней отдыха" перед записью объекта,
// если поля доступны для редактирования. В случае незаполненности хотя бы одного из полей
// выводит соответствующее сообщение и блокирует запись.
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Элементы.ДнейРаботы.Доступность Тогда
		Если Не ЗначениеЗаполнено(Объект.ДнейРаботы) Тогда
			Сообщить("Заполните количество дней работы.");
			Отказ = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ДнейОтдыха) Тогда
			Сообщить("Заполните количество дней отдыха.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры
// -- SMPlekhanov@1bit.com 23.03.2024 [Самообучение]
